clc
clear
close all

x1 = csvread('random_number.csv');

#예측0실제0
n00 = sum(x1(:,1)==0 & x1(:,2)==0);
#예측0실제1
n01 = sum(x1(:,1)==1 & x1(:,2)==0);
#예측0실제2
n02 = sum(x1(:,1)==2 & x1(:,2)==0);

#예측1실제0
n10 = sum(x1(:,1)==0 & x1(:,2)==1);
#예측1실제1
n11 = sum(x1(:,1)==1 & x1(:,2)==1);
#예측1실제2
n12 = sum(x1(:,1)==2 & x1(:,2)==1);

#예측2실제0
n20 = sum(x1(:,1)==0 & x1(:,2)==2);
#예측2실제1
n21 = sum(x1(:,1)==1 & x1(:,2)==2);
#예측2실제2
n22 = sum(x1(:,1)==2 & x1(:,2)==2);

#3*3 confusion matrix만들기
#mat33 = magic(3);
#mat33(:,3) = mat33'
mat33 = [n00 n10 n20; n01 n11 n21; n02 n12 n22];